/*************************718开发板例程**********************

*   编写：718创新实验室
*		平台：STM32F103VET6科创培训开发板
*		说明：该例程使用官方库进行编写，由于作者的水平有限， 
*								若有不足之处， 还请大家见谅
*									建议大家多查阅数据手册，多在新生群和大家交流。

*************************************************************/

/*************************功能说明******************************
通过SPI点亮OLED屏幕
什么是OLED:有机自发光体屏幕https://baike.baidu.com/item/OLED%E5%B1%8F%E5%B9%95/1688158?fr=aladdin
什么是SPI:参见百度百科
	https://baike.baidu.com/item/SPI/4429726?fr=aladdin
	OLED采用的不是标准的SPI通信,采用的4根线分别是:
	D0:SPI时钟控制线										A5
	D1:SPI数据传输线,MOSI穿出数据				A7
	RES:复位线,给一个脉冲低电平就复位		A3
	DC:数据/命令选择线,高电平数据,低电平数据  A1
OLED控制过程:
	初始化SPI控制器,初始化GPIO管脚->初始化OLED屏幕->向OLED屏幕写要显示的内容
****************************************************************/

/*************************说明******************************
详细内容请查看Spi-OLED.h和Spi-OLED.c文件
************************************************************/

#include "Spi-OLED.h"			//包含OLED头文件

int main() 
{
  OLED_Init();						//OLED初始化
	OLED_Print(0,0,"HITWH");//OLED显示内容
	OLED_Print(0,2,"718InnovationLab");
	OLED_Print(0,4,"Welcome");
	OLED_Print(0,6,"Hello World");
  while(1);

}
