/**********************718创新实验室开发板例程*********************
*  编写：718创新实验室
*  平台：STM32F103VET6
*  说明：由于作者的水平有限，若有不足之处，还请大家谅解。
*		 建议大家多看看数据手册。     
******************************************************************/
/*************************功能说明********************************
通过光敏电阻adc采集光线强度,并显示在数码管上
*************************功能说明********************************/

#include "stm32f10x.h"
#include "adc.h"
#include "module_74hc595.h"

void main()
{
	uint16_t x,i,temp;
	hc595_init();
	NTC_CDS_Init();
	while(1)
	{
		x=GetNTC();
		i=0;

	while(x/10!=0)
		{
			temp=x%10;
			DisplayScan((7-i),data_table[temp]);
			x=x/10;
			i++;
		}
		DisplayScan(7-i,data_table[x]);
	}
}