#include "systick.h"

/**********************718创新实验室开发板例程*********************
*  函数名:Delay_us
*  参数:nus             
*  功能:进行微秒级别的延时
*	 使用示例:Delay_us(1000); 延时1000us
*******************************************************************/
void Delay_us(u32 nus)					
{
	u32 temp;
	SysTick->LOAD=(u32)nus*9; 					 	/*时间加载（LOAD为重装数值寄存器)*/
	SysTick->VAL =0x00; 							/*清空计数器(VAL为当前数值寄存器)*/
	SysTick->CTRL|=0x01;							/*开始对CTRL使能，并使为0时产生systick异常请求，无动作*/
	do
	{
			temp=SysTick->CTRL;							/*读取当前数值*/
	}
   while ((temp & 0x01) && (!(temp & (1 << 16))));  /*等待时间到达*/
	SysTick->CTRL=0x00;									/*结束使能，关闭计数器*/
	SysTick->VAL=0x00;									/*清空计数器*/
}
/**********************718创新实验室开发板例程*********************
*  函数名:Delay_ms
*  参数:nms             
*  功能:进行毫秒秒级别的延时
*	 使用示例:Delay_ms(1000); 延时1000ms
*******************************************************************/
void Delay_ms(u32 nms)
{
	u32 temp;
	SysTick->LOAD=(u32)nms*1000;  	/*时间加载（LOAD为重装数值寄存器)*/
	SysTick->VAL =0x00; 							/*清空计数器(VAL为当前数值寄存器)*/
	SysTick->CTRL|=0x01;							/*开始对CTRL使能，并使为0时产生systick异常请求，无动作*/
	do
	{
			temp=SysTick->CTRL;							/*读取当前数值*/
	}
   while ((temp & 0x01) && (!(temp & (1 << 16))));  /*等待时间到达*/
	SysTick->CTRL=0x00;									/*结束使能，关闭计数器*/
	SysTick->VAL=0x00;									/*清空计数器*/
}

//*****************************************************************************************

